'''
Вход:
строка 1 -- массив целых чисел через пробел (может быть пустым),
строка 2 -- целое K.

Нужно посчитать количество непустых подмассивов (непрерывных фрагментов массива), сумма элементов в которых равна K.

Выход: одно целое число.

Граничные случаи: пустой массив даёт ответ 0. Подмассивы считаем только непустые.
'''


array = list(map(int, input().split()))
k = int(input())
n = len(array)
result = 0

for i in range(n):
    summ = 0
    for j in range(i, n):
        summ += array[j]
        if summ == k:
            result += 1

print(result)